# a = "string"
# print (type(a))
# print (id(a))
# print (a)
# # print (30,96,"строка", a)
# print (1 + 1 + 3)
from gc import get_debug

# a = 10
# b = 100
# #c = 313
# # print (a, b, c, sep='')
# # # sep=' ' разделитель строк. Внутри '' должен быть пробел, как тут ' ', иначе все объекты будут выводиться слитно. Также может что-то записать/вставить внутри разделителя
# # # end='' заканчивает строку и переходит в новую, а если внутри "" сделаем пробел "  ", то следующий print будет выводить значения в одной строке вместе с предыдущими значениями
# # print (a, b, c, sep=' ', end='')
# print ("Результат умножения числа", a, "и числа", b, "равен", a * b)
# print (f"Результат умножения числа {a} и числа {b} равен {a * b}")
# a = input ()
#print(a)
a = input()
print(a)
b = input()
print(b)
