# 1. Работа с целыми и вещественными числами
a = 10
s = 20
x = 10.1
y = 21.1
print(type(a))
print(type(s))
print(type(x))
print(type(y))

# 2. Основные арифметические операции
num1 = 100
num2 = 200
print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)

# 3. Особенности работы с делением
a = 10
b= 3
print(a / b)
print(a // b)
print (a % b)
a = -10
b = -3
print (a / b)
print (a // b)
print (a % b)
a = -10
b = -3
print (a / b)
print (a // b)
print (a % b)
# знак / делит на вещественные числа даже если работает с целыми числами. // делит на целые числа и округляет в болльшую или меньшую сторону по математическому принципу
# а знак % показывает остаточное число, а как с -10 -3 не совсем понял, разюерусь.

# 4. Работа с приоритетом операторов
a = 5 + 3 * 2
print (a)
s = (5 + 3) * 2
print (s)
d = 10 / (2 ** 2)
print (d)
f = (20 - 3) * 4 / 2
print (f)

# 5. Возведение в степень
a = 2 ** 3
q = 4 ** 0.5
w = 27 ** (1/3)
e = 5 * 8 -1
print(a)
print(q)
print(w)
print(e)
# 2. Объясни, что означает каждое выражение - тут я хз что объяснять. Например в переменной a = 2 ** 3 говорим, мол, 2 умножь само себя 3 раза, 2*2=4, 4*2=8

# 6. Использование сокращенных операторов count еще не изучили же по ходу урока или я что-то пропустил? на 3 урове были операторы and or sep= индексы. ДЗ не совсем по теме что ли, как думаешь?)
s = 3

