# """
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Методы строк
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Работа с регистром
# ================================================
# Создай строку s = "Python для автоматизации".
# Преобразуй строку в верхний регистр и выведи результат.
# Преобразуй строку в нижний регистр и выведи результат.

s = "Python для автоматизации"
print(s.upper())
print(s.lower())

# ================================================
# 2. Подсчет вхождений подстроки
# ================================================
# Создай строку msg = "абракадабра".
# Найди, сколько раз встречается подстрока "ра" в строке msg.
# Определи количество "а", начиная с 3-го символа.

msg = "абракадабра"
res = msg.count("ра")
print(res)
res2 = msg.count("а", 3)
print(res2)

# ================================================
# 3. Поиск подстроки
# ================================================
# Определи индекс первого вхождения "ка" в строке "абракадабра".
# Найди индекс последнего вхождения "а".
# Проверь, что произойдет, если искать "xyz" в строке.

print(msg.index("ка"))
print(msg.index("а", -1))
print(msg.find("xyz"))

# ================================================
# 4. Замена подстроки
# ================================================
# Создай строку text = "Я изучаю Java".
# Замени "Java" на "Python".
# Удали все пробелы из строки.

text = "Я изучаю Java"
print(text.replace("Java", "Python"))
text = text.replace("Java", "Python")
print(text.replace(" ", ""))

# ================================================
# 5. Проверка содержимого строки
# ================================================
# Проверь, состоит ли строка "Python" только из букв.
# Проверь, состоит ли строка "12345" только из цифр.
# Проверь, что строка "123abc" не состоит только из цифр.

print("Python".isalpha())
print("12345".isdigit())
print("123abc".isdigit())

# ================================================
# 6. Дополнение строк
# ================================================
# Создай строку code = "42", дополни её до 5 символов слева нулями.
# Выравнивай строку "text" по ширине 10, добавляя * справа.

code = ("42")
print(code.rjust(5,"0"))

# text = "Я изучаю Python"
# print(text.ljust(20,"*"))
# print(text.ljust(10,"*"))

t = "text"
print(t.ljust(10,"*"))

# ================================================
# 7. Разбиение строк
# ================================================
# Разбей строку "яблоко, груша, банан" на список слов.
# Разбей "Python;Java;C++" по ";".

s = "яблоко, груша, банан"
a, b, v = s.split()
print(a)
print(b)
print(v)

s2 = "Python; Java; C++"
q, w, e = s2.split(";")
print(q)
print(w)
print(e)

# ================================================
# 8. Объединение списка в строку
# ================================================
# Соедини список ["Привет", "мир", "!"] в строку с пробелами.
# Преобразуй список ["apple", "banana", "cherry"] в строку через ", ".

q = "Привет"
q2 = "мир"
q3 = "!"
q4 = q + ", "+ q2 + q3
print(q4)

w = "apple, banana, cherry"
w2, w3, w4 = w.split(", ")
print(w2, w3, w4)


# ================================================
# 9. Удаление пробелов
# ================================================
# Удали пробелы слева в строке " Python".
# Удали пробелы справа в строке "Python ".
# Удали пробелы с обеих сторон в строке " Python ".
e = " Python"
print(e.lstrip())
e2 = "Python "
print(e2.rstrip())
e3 = " Python "
print(e3.strip())

# ================================================
# 10. Дополнительное задание
# ================================================
# Создай строку text = "программирование", сделай первую букву заглавной.
# Найди количество букв "р" в этой строке.
# Выведи индекс первой буквы "и".
# Разверни строку и выведи результат.

text = "программирование"
print(text.capitalize())
print (text.count("р"))
print(text[::-1])
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Спецсимволы
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Перевод строки
# ================================================
# Создай строку text = "Hello\nPython".
# Выведи её на экран. Объясни, почему "Python" перешел на новую строку.

text = "Hello\nPython"
print(text.replace("Python", "Java"))
#потому спецсимвол \n выводит на следующу строку

# ================================================
# 2. Горизонтальная табуляция
# ================================================
# Создай строку t = "Python\tAutomation".
# Выведи её и объясни, что делает \t.

t = "Python\tAutomation"
print(t)
# делает большой пробел Tab между строку в одной переменной/объекте

# ================================================
# 3. Экранирование символов
# ================================================
# Создай строку path = "C:\new\test.txt" и выведи её. Что произошло?
# Исправь ошибку, используя экранирование.
# Выведи строку "Марка вина "Ягодка"" так, чтобы кавычки внутри строки были корректными.

path = "C:\\new\\test.txt"
print(path) #программа часть текста \new\t воспринимает, как спецсимволы.
# Для получения целого текста должны указать двойные \\ ("C:\\new\test.txt") тогда получим то, что хотим
s4 = "Марка вина \"Ягодка\""
print(s4)

# ================================================
# 4. Сырые (raw) строки
# ================================================
# Создай строку path = r"C:\new\test.txt" и выведи её.
# Объясни разницу между обычной и сырой строкой.

path1 = r"C:\new\test.txt"
print(path)
#с помощью сырой строки мы можем сразу выводить символы без дополнительных \

# ================================================
# 5. Использование разных спецсимволов
# ================================================
# Создай строку s = "Hello\b World" и выведи её. Что произошло?
# Создай строку s = "Hello\fPython" и выведи её.

s = "Hello\b World"
print(s) #символ \b удаляет шаг влеко
s = "Hello\fPython" #символ разрыва?
print(s)

# ================================================
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Форматирование строк
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Формирование строк через конкатенацию
# ================================================
# Создай переменные имя и возраст.
# Сформируй строку "Меня зовут {имя}, мне {возраст} лет." с помощью оператора + и выведи её.
# Попробуй добавить число в строку без str(). Что произойдёт?

name = "Умар"
age = 30
im = f"Меня зовут {name}," + f" мне {age} лет"
print(im)

# ================================================
# 2. Форматирование строк с .format()
# ================================================
# Используя .format(), сформируй строку "Привет, меня зовут {имя}, мне {возраст} лет.".
# Используй .format() с именованными параметрами ({name}, {age}).
# Попробуй изменить порядок переменных в .format() и выведи строку.

# ================================================
# 3. Использование F-строк
# ================================================
# Создай переменные город и год.
# Выведи строку "Сегодня {год} год, и я живу в {город}." с помощью F-строки.
# Используй F-строку, чтобы вывести "Через 5 лет будет {год + 5} год.".

City = "Москве"
Year = 2026
Russia = f"Сегодня {Year} год, и я живу в {City}"
Future = f"Через 5 лет будет {Year + 5} год"
print(Russia)
print(Future)

# ================================================
# 4. Операции внутри F-строк
# ================================================
# Выведи "Дважды мой возраст: {...}", используя F-строку.
# Применяй .upper() к переменной, чтобы вывести имя в верхнем регистре.

i = 30
im = f"Дважды мой возраст: {i * 2}"
print(im)
print(im.upper())

# ================================================
# 5. Дополнительное задание
# ================================================
# Используя .format(), сформируй строку "Курс валют: 1 доллар = 92.5 рубля.", подставляя переменные.
# Используя F-строку, сформируй "Квадрат числа 7 равен 49.", вычисляя 7 ** 2 прямо внутри строки.
# """

g = "Курс валют: {} доллар = {} рубля."
print(g.format(1, 95.2))

a = 7
v = f"Квадрат числа {a} равен {7**2}"
print(v)